[{"file": "../npc/Event/Valentina_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Lucius_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Billy_The_Baker_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Brian_The_Baker.md", "conversation": [{"Player": "Hi"}, {"Brian The Baker": "Hi there Player. Are you here to help?"}, {"Player": "No"}, {"Brian The Baker": "Too bad, I guess we could need some more."}, {"Player": "Help / Job"}, {"Brian The Baker": "I'm a member of the Magic Bakery Alliance. We are an order that is dedicated to further the knowledge of bakery for the benefit of mankind. Our goals are as numerous as the recipes we come up with each season."}, {"Player": "Goals"}, {"Brian The Baker": "Currently we are trying to reclaim another part of Kullu's wisdom. Year after year, we try our best to break the defences of Cake Keep Isle."}, {"Player": "Kullu"}, {"Brian The Baker": "He was a great mage but an even greater cook. His recipes and spells are priceless. Sadly, even if we succeed in breaking the defences of Cake Keep Isle, we will only manage to decipher a tiny fraction of his knowledge. ..."}, {"Brian The Baker": "And still, we don't know what happened to Kullu. He retreated from our world to fully concentrate on his research on cooking recipes and spells. ..."}, {"Brian The Baker": "He was some sweet tooth for all that we know. And for sure a genius when it comes to baking and magic. ..."}, {"Brian The Baker": "His kitchen magic was that amazing, you could not tell where baking ended and magic started."}, {"Player": "Keep"}, {"Brian The Baker": "To be undisturbed, he placed his keep on an isle that existed on a planar instability which allowed him to phase the isle out of existence for most of the time. ..."}, {"Brian The Baker": "Additionally he surrounded the isle with a sorcery of his invention that defied most attempts to reach it. ..."}, {"Brian The Baker": "It took us quite a while to figure out that he'd never be able to weave a protection spell against something he loved so dearly like cakes and bakery wares. ..."}, {"Brian The Baker": "So we came up with the idea of the bridge."}, {"Player": "Bridge"}, {"Brian The Baker": "After a few failed attempts with gingerbread boats and the like, we figured out how to reach Cake Keep Isle. We used the very ingredients we could derive from his cake golem attacks to build a stable cake bridge to his isle."}, {"Player": "Golem"}, {"Brian The Baker": "Ah well, that's an .. uhm .. funny story. ..."}, {"Brian The Baker": "You see, after the first expedition reached the isle, they took so long trying to find a way to Kullu's secrets that the isle began to vanish into the void while they were still there. ..."}, {"Brian The Baker": "The entire time, they were harassed by Kullu's cake golem guardians of the keep. In the last minute, they cast emergency teleports to their home cities. ..."}, {"Brian The Baker": "The good thing is it was not too late and all escaped. Well, the bad thing is their spells somehow reacted with the void-rift of that place, building astral tunnels from the void to said cities. ..."}, {"Brian The Baker": "Now, whenever the isle manifests, the tunnels manifest as well. The ugly part is that through this one-way tunnels the cake golem army that was apparently sucked into the void has access to the cities and can raid them. ..."}, {"Brian The Baker": "But they are not only an annoyance but also our greatest chance. Nasty but tasty little buggers. They can be troublesome but we need them for our bridge construction."}, {"Player": "chance"}, {"Brian The Baker": "The golems that raid the cities supply us with two major materials that we need to build our bridge to Cake Keep Isle. ..."}, {"Brian The Baker": "One component is the sugary mass that can be gained if you slay one of them. We use it as a kind of mortar. ..."}, {"Brian The Baker": "The second part is a bit trickier to get. It is the raw cake material. It is kind of challenging to gain it. We built extraction machines that can drain the base material from the still animated corpses. ..."}, {"Brian The Baker": "We placed one in each of the raided cities. You will have to lure the golems into the machines, to extract the material from them. ..."}, {"Brian The Baker": "We need it to have a stable base material that is resilient against wind, weather and salt water."}, {"Player": "Mass"}, {"Brian The Baker": "We accumulated ??? of 200 sugary mass. We can't fail this year! We will not allow it!"}, {"Player": "Base"}, {"Brian The Baker": "I'm somewhat worried. Getting the base material is always the tricky part. People are usually a bit too eager to kill. We accumulated ??? of 200 base material until now."}, {"Player": "Magic Bakery Alliance"}, {"Brian The Baker": "We are a mystic order of bakers who pursue goals for the benefit of all mankind. Don't even listen to the lies and propaganda spread by those who envy us."}, {"Player": "Order"}, {"Brian The Baker": "We are a mystic baker order. Don't listen to those who envy us and spread ugly lies and propaganda. We are dedicated to uncover the greatest secrets about cooking and baking. ..."}, {"Brian The Baker": "Baking is the only trade worth to be considered. Without bakers everyone would starve. We are what ties a society together, preferably with a thick, sticky and sweet mass made of fruits. ..."}, {"Brian The Baker": "We are the momentum of culture. Baking is what divides civilization from barbarism."}, {"Player": "Lies"}, {"Brian The Baker": "Though most of our noble order abandoned the more theoretical studies at the academies, it is an evil lie that we are failed students who know more about drinking and eating than about magic. ..."}, {"Brian The Baker": "Once we have revealed all of Kullu's secrets, we will be envied by all. And of course we all will become famous and incredibly rich."}, {"Player": "Recipes"}, {"Brian The Baker": "Kullu's recipes are as precious and complicated as are his spells. You often even need magic to have them done. Instant freezing and boiling are quite handy for most of them. ..."}, {"Brian The Baker": "Not to mention the special conditions you have to take care of. Though most people lack the refinement of tasting skills to recognise the difference of a pasta caramellum made at full moon in winter and one made at an eclipse in autumn."}, {"Player": "Isle"}, {"Brian The Baker": "Now once we've got enough ingredients to finish the bridge, we have to face another challenge. And that is the cake keep itself! Is is an almost impenetrable though edible fortress made completely out of cake! ..."}, {"Brian The Baker": "The thing is, to reach his secrets we will have to eat the whole cake! This is easier said than done though as the the cake regenerates itself periodically with the help of magic. ..."}, {"Brian The Baker": "So we only have a few minutes to eat a whole layer of the cake, only then it will not regenerate but the upper layer will come down. So layer for layer we have to eat that cake. ..."}, {"Brian The Baker": "It will take an army of hungry Tibians to eat them all in time. Even then things have to be somewhat coordinated. ..."}, {"Brian The Baker": "People have to be brought here, wait for their turn to eat and of course stay hungry. Eating another layer might prove futile if you do not wait a few minutes for the hunger to return. ..."}, {"Brian The Baker": "The good thing is that all people, big and small, can participate. ..."}, {"Brian The Baker": "I guess the isle had a nice and flashy name in the past. But you know how people are. Someone started to call it the Cake Isle and I guess it is only a matter of time until this is shortened to CI. ..."}, {"Brian The Baker": "People don't take their time anymore, not even for enjoyment."}, {"Player": "Spells"}, {"Brian The Baker": "Kullu's spells are highly sought after. There are a few minor ones he sold before he became an eremite. And there are rumours about some others."}, {"Player": "Rumours"}, {"Brian The Baker": "Well for instance there is the ultimate sweetness spell that makes everything taste extremely sweet. Even if you freeze or hit your finger with an hammer it tastes sweet! ..."}, {"Brian The Baker": "Or the refill spell that refills your cup, bottle, bowl etc. as long as there is a tiny bit left in it. Marvels that we will rediscover!"}, {"Player": "Name"}, {"Brian The Baker": "I am Brian. Brian the baker, that is."}, {"Player": "Machines"}, {"Brian The Baker": "We invented machines that can extract the essence of the cake golems. That is the part that gives them the stability to move and withstand damage and environmental hazards. ..."}, {"Brian The Baker": "Well, actually we had them built by the dwarven technomancers. But it was us who figured out the basic principles! ..."}, {"Brian The Baker": "However, whenever a cake golem gets into one of those machines, it gets disassembled in the blink of an eye and we get the enchanted base which we use to build our bridge."}, {"Player": "Sugar"}, {"Brian The Baker": "Do you have some sugar for me? Please note that you can hand me all your sugar at once, if you want to."}, {"Player": "Yes"}, {"Brian The Baker": "Sorry, you don't have the sugar we are looking for. You can loot it from the cake golems."}, {"Player": "Bye"}, {"Brian The Baker": "Good bye."}]}, {"file": "../npc/Event/Demon_Mother.md", "conversation": [{"Demon Mother": "Oh no. Not again!"}, {"Demon Mother": "Where is this brat again?"}, {"Demon Mother": "You need a serious beating."}, {"Demon Mother": "I want some days off."}, {"Player": "hi"}, {"Demon Mother": "Greetings, meatbag. Speak quick, my patience is short."}, {"Demon Mother": ""}, {"Player": "job / patience"}, {"Demon Mother": "I'm the mother of thousands of demons. If you think they are a pain when they are grown up, you haven't met the young ones. And particularly the babies can be bothersome. ..."}, {"Demon Mother": "I desperately need a few days off or I cannot guarantee for anything!"}, {"Player": "babies"}, {"Demon Mother": "My little darlings are somewhat tiresome sometimes. And there are hundreds of them. Even I need a rest from time to time. Some time for myself. Do you have any idea for how long I didn't have had my horns done? ..."}, {"Demon Mother": "And it's not easy for a single demon mother to meet an evil guy. As soon as they hear you have a few hundred children at home, they teleport into another dimension! ..."}, {"Demon Mother": "Even demon mothers want to relax now and then, have a bath in the lava pits and listen to the screams of some tortured souls. ..."}, {"Demon Mother": "And I am not the kind of mother that let's her little demons watch the torture pits the whole day. I expect from them to do something creative and evil on their own. ..."}, {"Demon Mother": "I won't drop them into some foreign dimension to take care of their own like other demon mothers do. ..."}, {"Demon Mother": "Of course a torn off head will regrow in a few days but I'm old-fashioned and don't like to see my little darlings suffer. ..."}, {"Demon Mother": "This is where you come in! I entrust this world to take care for my little darlings for a while!"}, {"Player": "pacifier"}, {"Demon Mother": "Ah, well. My kids sometimes like it rough. To calm them, I usually slap something hard on their head. Hey, don't give me that look, we are demons after all."}, {"o evento": ""}, {"Player": "challenge"}, {"Demon Mother": "I need some of you mortals to care for some of my children. They are only demon babies so it shouldn't be too hard, even for such limited creatures as you are. ..."}, {"Demon Mother": "I'll hand you one of my babies and you'll take care of it. You can only care for one baby at a time. ..."}, {"Demon Mother": "Demon babies are moody and spoilt. Each few hours it will request something from you and you will have to fulfil its wishes to keep it happy. It will let you know what it wants. ..."}, {"Demon Mother": "Do whatever pleases the baby to satisfy it for a few hours. If you comply with its wishes often enough, it will become cheery. It might take a few days and don't think it's easy. ..."}, {"Demon Mother": "Some of the baby's wishes might be exotic and others outright dangerous. But that is the fate of babysitters since the dawn of time. ..."}, {"Demon Mother": "Bring my darlings back to me as soon as they are cheery. This phase will last for a while and it will be easy for me to keep an eye on them. ..."}, {"Demon Mother": "If enough of your people help me and bring me my cheery darlings, I will be pleased and your world will be rewarded. ..."}, {"Demon Mother": "If you fail though .. well, let's say you will not like this alternative. I can become really mean if I am mad and most demons owe me something! ..."}, {"Demon Mother": "So are you up to this?"}, {"Player": "yes"}, {"Demon Mother": "Uh ... Uhm ... Really? Fabulous! Here we go! Take care! It is now bound to YOU, so don't try to swap it with another baby. My magic will prevent that and return it to you!"}, {"Player": "babysitters"}, {"Demon Mother": "Are you ready to take care of one of my little darlings for a while?"}, {"Player": "yes"}, {"Demon Mother": "Hey! I already gave you one of my children! If you have failed to take care of it, it will find me. And then I'll find YOU!"}, {"Player": "no"}, {"Demon Mother": "Though I feel like tearing you apart, I can't even blame you. Still, if your world fails, I will make you suffer!"}, {"Player": "pleased baby (Entregando o demon infant)"}, {"Demon Mother": "Are you here to bring one of my little darlings back to me?"}, {"Player": "yes"}, {"Demon Mother": "Brilliant! Your world might actually avert my wrath. We will see."}, {"Player": "demon"}, {"Demon Mother": "We are creatures of power and knowledge. We are more diverse than you mortals will ever comprehend. The knowledge and wisdom we have gained in our long lives are paling your fleeting vision of what you think is the world."}, {"Player": "zathroth"}, {"Demon Mother": "Do you really think I have time to think about gods? I have hardly time for a spontaneous prayer that Zathroth may give me some spare time! ..."}, {"Demon Mother": "But I guess he is too busy and can't answer those prayers, so I take the matter into my own hands, just like mothers usually do."}, {"Player": "pits of inferno"}, {"Demon Mother": "I forbid my children to play there. With all those good-doers questing there, they might get hurt."}, {"Player": "bye"}, {"Demon Mother": "<Grumbles>"}]}, {"file": "../npc/Event/Dread_Guardian.md", "conversation": [{"Player": "hi"}, {"Dread Guardian": "Hello, mortal. What are you doing in this realm?"}, {"Player": "realm"}, {"Dread Guardian": "This is the realm of Devovorga."}, {"Player": "Devovorga"}, {"Dread Guardian": "She slumbers, and she dreams... at least what is left of her essence."}, {"Player": "essence"}, {"Dread Guardian": "The essence of Devovorga is trapped in this realm. Are you here to help me fight them?"}, {"Player": "name"}, {"Dread Guardian": "Your body is not made for pronouncing it."}, {"Player": "job"}, {"Dread Guardian": "I am a guardian."}, {"Player": "guardian"}, {"Dread Guardian": "I fight the essence of Devovorga and guard the portal to the upper world."}, {"Player": "bye"}, {"Dread Guardian": "Leave fast."}, {"Player": "Anmothra"}, {"Dread Guardian": "The soul of Devovorga. Would you like to give me 2 tentacle pieces and fight this incarnation?"}, {"Player": "Yes"}, {"Dread Guardian": "You may now enter the gate to the south as soon as the room is free. You have then 10 minutes to fight Anmothra. ..."}, {"Dread Guardian": "If your powers fail you, you can flee from the fight - but you'll have to give me tentacle pieces again to gain another chance. Good luck. ..."}, {"Dread Guardian": "Don't expect a reward from me - ensuring the safety of your world should be reward enough."}, {"Player": "Chikhaton"}, {"Dread Guardian": "The power of Devovorga. Would you like to give me 12 tentacle pieces and fight this incarnation?"}, {"Player": "Yes"}, {"Dread Guardian": "You may now enter the gate to the south as soon as the room is free. You have then 10 minutes to fight Chikhaton. ..."}, {"Dread Guardian": "If your powers fail you, you can flee from the fight - but you'll have to give me tentacle pieces again to gain another chance. Good luck. ..."}, {"Dread Guardian": "Don't expect a reward from me - ensuring the safety of your world should be reward enough."}, {"Player": "Irahsae"}, {"Dread Guardian": "The fury of Devovorga. Would you like to give me 5 tentacle pieces and fight this incarnation?"}, {"Player": "Yes"}, {"Dread Guardian": "You may now enter the gate to the south as soon as the room is free. You have then 10 minutes to fight Irahsae. ..."}, {"Dread Guardian": "If your powers fail you, you can flee from the fight - but you'll have to give me tentacle pieces again to gain another chance. Good luck. ..."}, {"Dread Guardian": "Don't expect a reward from me - ensuring the safety of your world should be reward enough."}, {"Player": "Phrodomo"}, {"Dread Guardian": "The hatred of Devovorga. Would you like to give me 16 tentacle pieces and fight this incarnation?"}, {"Player": "Yes"}, {"Dread Guardian": "You may now enter the gate to the south as soon as the room is free. You have then 10 minutes to fight Phrodomo. ..."}, {"Dread Guardian": "If your powers fail you, you can flee from the fight - but you'll have to give me tentacle pieces again to gain another chance. Good luck. ..."}, {"Dread Guardian": "Don't expect a reward from me - ensuring the safety of your world should be reward enough."}, {"Player": "Teneshpar"}, {"Dread Guardian": "The dark knowledge of Devovorga. Would you like to give me 8 tentacle pieces and fight this incarnation?"}, {"Player": "Yes"}, {"Dread Guardian": "You may now enter the gate to the south as soon as the room is free. You have then 10 minutes to fight Teneshpar. ..."}, {"Dread Guardian": "If your powers fail you, you can flee from the fight - but you'll have to give me tentacle pieces again to gain another chance. Good luck. ..."}, {"Dread Guardian": "Don't expect a reward from me - ensuring the safety of your world should be reward enough."}]}, {"file": "../npc/Event/Solkrin_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Benny_The_Baker_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Robson_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Santa_Claus.md", "conversation": [{"Player": "hi / hello"}, {"Santa Claus": "Merry Christmas, little Player!"}, {"Player": "name / job"}, {"Santa Claus": "Ho ho ho! You don’t know Santa Claus? Never mind. You may ask me for a present."}, {"Player": "present"}, {"Santa Claus": "Here is your present! Enjoy!"}, {"Player": "present"}, {"Santa Claus": "You already got your present! Don’t be greedy!"}, {"Player": "thank you"}, {"Santa Claus": "Oh – you absolutely deserve it! You’ve behaved really well this year. Almost no bad things about you in my book!"}, {"Player": "thank you"}, {"Santa Claus": "Thank you too, little Player, for coming to see me this year."}, {"Player": "thank you"}, {"Santa Claus": "Keep up this friendliness and politeness and we shall see about a really cool present next year!"}, {"Player": "thank you"}, {"Santa Claus": "May the coming year be full of joy, happiness and love for you! You don’t always have to be on the tough side, you know."}, {"Player": "thank you"}, {"Santa Claus": "Oh, little Player, watching you from above always makes my heart smile. I’ll be looking forward to seeing you next Christmas!"}, {"Player": "thank you"}, {"Santa Claus": "Yes, you should thank me! I ignored that evil thing you did last year and gave you a present anyway. You know what I mean."}, {"Player": "thank you"}, {"Santa Claus": "You had a few hard times last year, I know. Considering all that you did well and I’m proud of you."}, {"Player": "thank you"}, {"Santa Claus": "Your good and bad deeds are pretty balanced. If you try and lean more towards the good side, I’ll consider giving you a really nice present next year!"}, {"Player": "thank you"}, {"Santa Claus": "You’re one of my favourite children, little Player. But pssht, don’t tell the others! I love all of you, of course."}, {"Player": "thank you"}, {"Santa Claus": "You’ve been so good during the last year that I was almost tempted to give you a Ferumbras’ hat. But I didn’t want to make the other children jealous."}, {"Player": "bye / farewell"}, {"Santa Claus": "Farewell, Player!"}]}, {"file": "../npc/Event/Minzy.md", "conversation": [{"Player": "'Hi"}, {"Minzy": "Welcome. Good you're showing up"}, {"Player": "Showing up / Job"}, {"Minzy": "I've never considered to follow a profession. But people tend to call me a swamp witch because I sometimes make brews with unusual ingredients in my cauldron. So I guess that is what I am."}, {"Player": "Witch"}, {"Minzy": "Not all witches are evil. Neither do all of us fit into such simple categories like good and evil at all. ..."}, {"Minzy": "In these days, several of us work for a common cause and put our differences aside for a greater goal. ..."}, {"Minzy": "I think there is a lot to learn from this and I hope it will somehow be an inspiration for others."}, {"Player": "Brews"}, {"Minzy": "The brew is not ready by far. We are just beginning and there is much left to be done."}, {"Player": "Ingredients"}, {"Minzy": "We need the ingredients and we need many of them. We gather supplies the whole year and prepare most of the brew in advance. ..."}, {"Minzy": "But with our numbers dwindling, we need more and more help of the Tibians to save the world. You might gain our favour by helping us in our mission."}, {"Player": "'Cauldron"}, {"Minzy": "The cauldron is ancient and sacred to us. It bears powerful enchantments and years of use in rituals have changed its very structure in the fabric of reality."}, {"Player": "Brew"}, {"Minzy": "The brew is not ready by far. We are just beginning and there is much left to be done."}, {"Player": "Favour"}, {"Minzy": "By sacrificing items for our cause or igniting the cauldron's fire you will gain some favour within our circle. ..."}, {"Minzy": "We are willing to trade certain potions to you. Your current favour is 2."}, {"Player": "Trade"}, {"Minzy": "We offer mana potions, strong mana potions and great mana potions. We also offer health potions, strong health potions, great health potions and ultimate health potions. And we offer great spirit potions."}, {"Player": "Mana potions"}, {"Minzy": "Sorry, your favour is not high enough."}, {"Player": "Name"}, {"Minzy": "I am known as Minzy."}, {"Player": "Banebringer"}, {"Minzy": "We have to hold the ritual in these days when they are strongest. They might even manifest now and then harass us in our ritual with the help of rotten dead things . ..."}, {"Minzy": "But this is nothing compared to their wrath if we should fail the ritual. We would have to wait a whole year to try a new ritual and had to endure the malignant attacks of the bane bringers in the meantime."}, {"Player": "Attacks"}, {"Minzy": "The bane bringers work in a very subtle way. You might lose connection to a dear friend, have considerable streaks of bad luck or make new enemies. ..."}, {"Minzy": "Perhaps they'd let something of your possession vanish or make you look like a cheater or liar through some strange coincidence. The worst thing they do is eating away your luck and happiness though."}, {"Player": "Venore"}, {"Minzy": "One would guess the trade barons could easily spare the ingredients for the brew, but they won't lift a finger and call us superstitious fools. ..."}, {"Minzy": "In the past, they even sent mercenaries to disrupt our ritual but our resistance proved too expensive for their tastes. Still, we failed to complete the ritual that year and many suffered."}, {"Player": "Magic"}, {"Minzy": "I won't share my knowledge with strangers. Besides, there is little I know that would be of any practical use at all for you."}, {"Player": "Ferumbras"}, {"Minzy": "He has stolen much of his knowledge from several sources. The community of witches suffered particularly from his greed. ..."}, {"Minzy": "We will not forget this. Although, some misguided souls sell themselves to him for some of the stolen and now lost knowledge in return."}, {"Player": "Excalibug"}, {"Minzy": "Weapons, weapons. Is this all you people care about? The bane bringer threat is a far more imminent event. This should be our focus."}, {"Player": "Bye"}, {"Minzy": "Take care my friend."}]}, {"file": "../npc/Event/Stan.md", "conversation": [{"Player": "hi"}, {"Stan": "YOU DARE TALKING TO ME, MORTAL?!! … Relax, it’s just a costume. Welcome to Stan’s!"}, {"Player": "job"}, {"Stan": "I own this shop of magical, wonderful, unsavoury, frightening and cuuuuute costumes! My name is Stan and I’m at your service!"}, {"Player": "costume"}, {"Stan": "Making these costumes is not as easy as it seems. Have you ever asked yourself how an adult human fits into a dwarf costume? Well, you won’t learn it from me! …"}, {"Stan": "Otherwise everyone opens up a costume shop ruining my life AGAIN! Anyway I can offer you costumes in three categories: ‘common’, ‘uncommon’ or ‘deluxe’. Which category are you interested in?"}, {"Player": "name"}, {"Stan": "Stanley Montgomery Edward Wilson Jaydon Alverton at your service! Just say Stan!"}, {"Player": "king / tibianus"}, {"Stan": "You’re a genius. Imagine to have a King Tibianus costume! Well, I think the king himself won’t consider it as funny as I do but anyway. You could just walk into the palace …"}, {"Stan": "… and give some nonsensical orders to those boneheaded guards! Hilarious! I’ve got to remember that! Oh, you wanted to know whether I like him or not? Well, I like my idea of a king costume better!"}, {"Player": "rumour"}, {"Stan": "There are rumours about people getting killed while wearing my costumes. There was this toothless guy, can’t remember his name, he bought a demon costume and then started running around screaming …"}, {"Stan": "‘YOUR SOUL WILL BE MINE!’. Don’t be surprised if you get killed when you act that stupid."}, {"Player": "offer"}, {"Stan": "You can buy party hats and party trumpets from me. In addition I can offer you costumes in the very best quality you can get! If you know someone selling better costumes than me, tell me his name and I go and kill that guy! Hahahaha, just kidding! …"}, {"Stan": "Now serious, I can offer you costumes in three categories: ‘common’, ‘uncommon’ or ‘deluxe’. Which category are you interested in?"}, {"Player": "party"}, {"Stan": "Hurray!"}, {"Player": "joke"}, {"Stan": "Sorry, I don’t know any more jokes."}, {"Player": "magic"}, {"Stan": "My costumes will bewitch your friends but there is no real magic in them. The big ones are a little bit difficult to handle but you will get the hang of it."}, {"Player": "costume"}, {"Stan": "Making these costumes is not as easy as it seems. Have you ever asked yourself how an adult human fits into a dwarf costume? Well, you won’t learn it from me! …"}, {"Stan": "Otherwise everyone opens up a costume shop ruining my life AGAIN! Anyway I can offer you costumes in three categories: ‘common’, ‘uncommon’ or ‘deluxe’. Which category are you interested in?"}, {"Player": "common"}, {"Stan": "This is the cheapest. For 500 gold you get one of five common costumes. Spectacular, but if you know the ‘creature illusion’ spell, you may be disappointed. …"}, {"Stan": "But if you and your friends want to dress up as an orc horde for example, it will be the perfect deal for you! Just ask me for a trade."}, {"Player": "uncommon"}, {"Stan": "It’s getting warmer! In this category you will get one of five costumes in good quality and therefore for 1000 Gold! …"}, {"Stan": "You will be amazed of these costumes, I promise! Just ask me for a trade."}, {"Player": "deluxe"}, {"Stan": "I knew you are a deluxe guy! Your friends will be astonished about your costume! You will get one of five costumes of the finest quality you will ever face in your life!! …"}, {"Stan": "I ruin myself but I will give it to you for only 1500 Gold! Just ask me for a trade."}, {"Player": "trade"}, {"Stan": "Have fun with your carnival stuff and recommend me to your friends!"}, {"Player": "human"}, {"Stan": "Sure, I’m human. Just sitting in this giant costume pulling strings."}, {"Player": "past"}, {"Stan": "I did many things before. Years ago I started out as a salesman for used boats but I was ripped off by a strange fellow. After that I opened up a shop for used coffins which also was a flop. …"}, {"Stan": "Then I tried my luck with selling life insurances but it didn’t work out with so many people dying and seconds later standing in front of you demanding the money for their own death. …"}, {"Stan": "Now I found my purpose in making these costumes and selling them for extortionate… err… extraordinarily good prices!"}, {"Player": "story"}, {"Stan": "I know loads of stories. Don’t know if you are interested in my past, my outfit or my costumes. I even can tell you some jokes if you want to."}, {"Player": "joke"}, {"Stan": "I only know five jokes but they are hilarious! Do you want to hear one?"}, {"Player": "yes"}, {"Stan": "Where does a blackbird go for a drink? You know that, huh? No? …"}, {"Stan": "To a crow bar!! Muahahahaha! Another one?"}, {"Player": "yes"}, {"Stan": "Why do hens lay eggs? You know that, huh? No? …"}, {"Stan": "If they dropped them, they’d break. Muahahahaha! Sooooo funny! Another one?"}, {"Player": "yes"}, {"Stan": "Two peaky vampires walking through the streets, almost starving. Then a third one shows up, his whole face blurred with blood. The two ask: ‘Where did you get the blood from?’ …"}, {"Stan": "The bloody one replies, ‘Do you see that wall over there?’. The two vampires say: ‘Yes’ and the bloody one: ‘Well, I didn’t!’ Muahahahaha!!! Another one?"}, {"Player": "yes"}, {"Stan": "Two guys are out hunting deer. The first guy says: ‘Did you see that?’,’No’ the second guy replies. ‘Well, a bald eagle just flew overhead!’, the first guy says. …"}, {"Stan": "A couple of minutes later, the first guy says: ‘Did you see that?’. ‘See what?’ the second guy asks. ‘Are you blind? There was a big, black bear walking on that hill, over there.’ …"}, {"Stan": "A few minutes later the first guy says, ‘Did you see that?’. By now, the second guy is getting angry, so he says: ‘Yes, I did!’. And the first guy says: ‘Then why did you step in it?’. Muahahahaha!! Another one?"}, {"Player": "yes"}, {"Stan": "In the Green Claw Swamp a dwarf was found, tied up with chains, gagged and with a heavy rock wrapped on his chest. The guard finding him says, ‘Damn dwarfs, they always steal more than they can carry!’ Muahahahaha!"}, {"Player": "outfit"}, {"Stan": "This is MY very special costume! I’m sorry but I can’t offer you that. It’s unique!"}, {"Player": "bye"}, {"Stan": "Cheerio!"}]}, {"file": "../npc/Event/Lunch_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Brutus_The_Baker.md", "conversation": [{"Player": "hi"}, {"Brutus The Baker": "Hi there player. I guess you are here to assist me in my job!"}, {"Player": "job"}, {"Brutus The Baker": "I'm a member of the Magic Bakery Alliance. We are an order that is dedicated to further the knowledge of bakery for the benefit of mankind. Our goals are as numerous as the recipes we come up with each season."}, {"Player": "goals"}, {"Brutus The Baker": "Currently we are trying to reclaim another part of Kullu's wisdom. Year after year, we try our best to break the defences of Cake Keep Isle."}, {"Player": "Kullu"}, {"Brutus The Baker": "He was a great mage but an even greater cook. His recipes and spells are priceless. Sadly, even if we succeed in breaking the defences of Cake Keep Isle, we will only manage to decipher a tiny fraction of his knowledge. ..."}, {"Brutus The Baker": "And still, we don't know what happened to Kullu. He retreated from our world to fully concentrate on his research on cooking recipes and spells. ..."}, {"Brutus The Baker": "He was some sweet tooth for all that we know. And for sure a genius when it comes to baking and magic. ..."}, {"Brutus The Baker": "His kitchen magic was that amazing, you could not tell where baking ended and magic started."}, {"Player": "reclaim"}, {"Brutus The Baker": "Now we are on Kullu's cake isle. We can gather some of his secrets before the isle will vanish again. But we won't be able to experiment with the secrets ..."}, {"Brutus The Baker": "That is, unless you are willing to help us in this matter!"}, {"Player": "keep"}, {"Brutus The Baker": "To be undisturbed, he placed his keep on an isle that existed on a planar instability which allowed him to phase the isle out of existence for most of the time. ..."}, {"Brutus The Baker": "Additionally, he surrounded the isle with a sorcery of his invention that defied most attempts to reach it. ..."}, {"Brutus The Baker": "It took us quite a while to figure out that he'd never be able to weave a protection spell against something he loved so dearly like cakes and bakery wares. ..."}, {"Brutus The Baker": "So we came up with the idea of the bridge."}, {"Player": "bridge"}, {"Brutus The Baker": "After a few failed attempts with gingerbread boats and the like, we figured out how to reach Cake Keep Isle. We used the very ingredients we could derive from his cake golem attacks to build a stable cake bridge to his isle."}, {"Player": "chance"}, {"Brutus The Baker": "The golems that raid the cities supply us with two major materials that we need to build our bridge to Cake Keep Isle. ..."}, {"Brutus The Baker": "One component is the sugary mass that can be gained if you slay one of them. We use it as a kind of mortar. ..."}, {"Brutus The Baker": "The second part is a bit trickier to get. It is the raw cake material. It is kind of challenging to gain it. We built extraction machines that can drain the base material from the still animated corpses. ..."}, {"Brutus The Baker": "We placed one in each of the raided cities. You will have to lure the golems into the machines, to extract the material from them. ..."}, {"Brutus The Baker": "We need it to have a stable base material that is resilient against wind, weather and salt water."}, {"Player": "help"}, {"Brutus The Baker": "Yes, yes! Just step somewhere on the cakes base on the isle. Then travel to one of our ingredient extractors at Thais, Carlin, Darashia, Liberty Bay and Edron. ..."}, {"Brutus The Baker": "They will extract the cake mass that is stuck on you. So if you want to feed another extractor you'll have to visit the isle again of course. ..."}, {"Brutus The Baker": "If you manage to feed all five extractors before the time runs out I will give you a special reward."}, {"Player": "reward"}, {"Brutus The Baker": "Well, not all our experiments with Kullu's recipes went well. But even the failures are good for something. We used them to create some beautiful as well as practical pieces of furniture, storage and decoration. ..."}, {"Brutus The Baker": "If you are interested - and have fed all five extractors with cake mass that is stuck on you -, I can hand you one."}, {"Player": "one"}, {"Brutus The Baker": "I have a choice of three rewards. Tell me which one you want: a cake cabinet, a cake backpack or a cake tapestry?"}, {"Player": "Magic Bakery Alliance"}, {"Brutus The Baker": "We are a mystic order of bakers who pursue goals for the benefit of all mankind. Don't even listen to the lies and propaganda spread by those who envy us."}, {"Player": "order"}, {"Brutus The Baker": "We are a mystic baker order. Don't listen to those who envy us and spread ugly lies and propaganda. We are dedicated to uncover the greatest secrets about cooking and baking. ..."}, {"Brutus The Baker": "Baking is the only trade worth to be considered. Without bakers everyone would starve. We are what ties a society together, preferably with a thick, sticky and sweet mass made of fruits. ..."}, {"Brutus The Baker": "We are the momentum of culture. Baking is what divides civilization from barbarism."}, {"Player": "lies"}, {"Brutus The Baker": "Though most of our noble order abandoned the more theoretical studies at the academies, it is an evil lie that we are failed students who know more about drinking and eating than about magic. ..."}, {"Brutus The Baker": "Once we have revealed all of Kullu's secrets, we will be envied by all. And of course we all will become famous and incredibly rich."}, {"Player": "name"}, {"Brutus The Baker": "I am Brutus. Brutus the baker, that is."}, {"Player": "isle"}, {"Brutus The Baker": "Now that the isle is conquered, we can search for Kullu's secrets, at least for a while."}, {"Player": "bye"}, {"Brutus The Baker": "Good bye."}]}, {"file": "../npc/Event/A_Beautiful_Girl.md", "conversation": [{"Player": "Hi"}, {"A Beautiful Girl": "So you have come, Player. I hoped you would not..."}, {"Player": "Job"}, {"A Beautiful Girl": "I don't have a profane 'job' - it is my destiny to devour evil and bring a new dawn."}, {"Player": "Help, Misson / Quest"}, {"A Beautiful Girl": "You sound like you wish to help me. Yet I must walk this path alone - but thank you."}, {"Player": "World/tibia"}, {"A Beautiful Girl": "I see how corrupt this world has become and it makes me want to cry."}, {"Player": "Name"}, {"A Beautiful Girl": "My name would be unspeakable for your tongue. You may call me Devovorga - which comes rather close."}, {"Player": "Corrupt"}, {"A Beautiful Girl": "What you call 'corruption' could be salvation - and what you consider 'good' is rotten to its pitch black close."}, {"Player": "Human"}, {"A Beautiful Girl": "You're welcome to join me in the pain you also helped causing."}, {"Player": "Creators"}, {"A Beautiful Girl": "Yes, I was created. And I'm not a mere being like humans, devils, demons or even gods. I'm a weapon. I'm devouring. I'm hungry. I want revenge."}, {"Player": "Devovorga"}, {"A Beautiful Girl": "How cute and shallow that sounds from your limited vocal chords and lips. You should have heard my enslavers pronounce it - accompanied by thunder in their voices that shook earth and sky."}, {"Player": "Trapped"}, {"A Beautiful Girl": "I'm trapped in this useless body. But I can feel it begin to change... finally..."}, {"Player": "Vengoth"}, {"A Beautiful Girl": "I've been waiting here for a long time. Even before this continent started turning dark."}]}, {"file": "../npc/Event/Casper.md", "conversation": [{"Player": "hi"}, {"Casper": "Hello and greetings! How I love our meetings!"}, {"Player": "meetings / job"}, {"Casper": "To guide you in this challenge I was sent, Kurik asked me to and so I went."}, {"Player": "challenge"}, {"Casper": "Down below awaits you a quest. Soon we will learn who is the best."}, {"Player": "below"}, {"Casper": "Go down now and be attentive and quick. With the slow ones kicked out, only the fastest will stick."}, {"Player": "fastest'"}, {"Casper": "If you are cunning and act smart, you might be lucky and get a reward."}, {"Player": "reward"}, {"Casper": "I'm not yet impressed and just for the rhyme ask me again but another time."}, {"Player": "best"}, {"Casper": "Change you will and run around. Find your match or return to the ground."}, {"Player": "change"}, {"Casper": "You've got your wand. Now leave me be. I say farewell, away with thee."}, {"Player": "Kurik"}, {"Casper": "Kurik the genius, Kurik the mad. Is the world hollow or is the world flat?"}, {"Player": "name"}, {"Casper": "I'm a jester, I'm a fool. I have no name, though it'd be cool."}, {"Player": "rhyme"}, {"Casper": "A charming smile and a rhyme on my lips, I'll give the fools a few answers and tips."}, {"Player": "bye"}, {"Casper": "Goodbye to you, our meeting was cool. I yet have to guess if you or me is the fool."}]}, {"file": "../npc/Event/Nathaniel.md", "conversation": [{"Player": "hi / hello"}, {"Nathaniel": "Greetings Player! You look like a friend of nature! Oh by the way, I have some news about the contest unless you want to talk about bonus points first!"}, {"Player": "envelope"}, {"Nathaniel": "The three wizards dropped these envelopes everywhere in the world. A lot of creatures have been carrying envelopes all over Tibia."}, {"Player": "bonus"}, {"Nathaniel": "You currently have no bonus points to spend. Would you like me to explain the bonus point system or do you want to exchange coloured powders?"}, {"Player": "exchange / queen / select / luck / chess"}, {"Nathaniel": "Mh, you are not of green colour. Either you did not join a wizard yet or – the unthinkable – you joined a different colour than green! You can only claim a reward from me once you have joined the green wizard."}, {"Player": "explain"}, {"Nathaniel": "Alright. Shall I talk about the collecting points or your rewards for exchanging points? Or do you ask yourself why Zaoan chess?"}, {"Player": "fan"}, {"Nathaniel": "There are two others like me, an orange fan in Carlin and some girl for violet in Thais. Trust me green is the colour to go… but hey, you can always check out the others."}, {"Player": "fern"}, {"Nathaniel": "Fern is the wizard of Nature. Behold his powers and the elemental might that is nature itself."}, {"Player": "furb / fun / orange / violer / spend"}, {"Nathaniel": "Mh, you are not of green colour. Either you did not join a wizard yet or – the unthinkable – you joined a different colour than green! You can only claim a reward from me once you have joined the green wizard."}, {"Player": "green / colour"}, {"Nathaniel": "Green is my colour. It is what I stand for. Green represents the wizard Fern of Nature of which I am a great fan."}, {"Player": "job"}, {"Nathaniel": "I am a fan and want to inform other Tibians about the BEST colour to join, the best wizard, the great CAUSE! NATURE! Wizard Fern, whose colour is green of course!"}, {"Player": "join"}, {"Nathaniel": "You can join any wizard by using the powder you can find in the envelope on yourself and the rest on someone who did not already join a wizard and has the right colour. …"}, {"Nathaniel": "Combining yellow and red will result in orange, yellow and blue will be green and red with blue results in violet."}, {"Player": "name"}, {"Nathaniel": "My name is Nathaniel. I am a friend of everything green!"}, {"Player": "nature"}, {"Nathaniel": "Nature is the element of Fern, the wizard I represent."}, {"Player": "news"}, {"Nathaniel": "The wizard contest has begun, join a colour – join green – join the friends of nature! I can also help you check the status of the contest if you’re already a fan!"}, {"Player": "points"}, {"Nathaniel": "As you know, the three wizards scattered magical envelopes all over Tibia. During this event, a lot of different kinds of monsters will drop those magic envelopes. …"}, {"Nathaniel": "These envelopes contain coloured powders you can use to colour yourself. Doing this, will yield 10 bonus points for you. …"}, {"Nathaniel": "You will receive another 10 bonus points if you find another player with the right colour for you to combine with and join one of the three wizards. …"}, {"Nathaniel": "In addition to the 20 points you can gather by joining a wizard you can collect up to 10 more points by returning any coloured powders you find. I am a fan of Fern, the green wizard of Nature and will accept blue and yellow powders. …"}, {"Nathaniel": "The fans of Feiz, the violet wizard of power will accept red and blue powders, Furb of Fun’s orange fans will accept yellow and red."}, {"Player": "powder"}, {"Nathaniel": "The envelopes that came with the creatures contain a magical powder. The three wizards created it to let you represent each of their elements."}, {"Player": "power / feiz"}, {"Nathaniel": "Feiz is the wizard of Power. Strength, influence and infinite might are his attributes. If you value these attributes, join him."}, {"Player": "rewards"}, {"Nathaniel": "To repay the continuing support of the Tibians, the wizards have created a special version of their favourite game – Zaoan chess. …"}, {"Nathaniel": "By taking part in the event and with a little luck you will be able to receive a unique set of Zaoan chess figurines, including a unique box for all 32 obsidian and jade pieces. …"}, {"Nathaniel": "For 5 points you will receive a surprise figurine of a random colour which can be anything, even the queen. …"}, {"Nathaniel": "For 20 points you will be able to select a figurine of a random colour except the queen. …"}, {"Nathaniel": "For 60 points you will receive a queen. Guaranteed and on top of that you will be able to choose the colour as well. …"}, {"Nathaniel": "You will receive the chess box for free from the appropriate fan if you have joined a wizard. Just ask me how to spend your points if you are ready."}, {"Player": "status"}, {"Nathaniel": "Violet seems to be the winning colour at the moment. Green is the runner-up."}, {"Player": "tibianus"}, {"Nathaniel": "I wonder what colour he chose…"}, {"Player": "wizard / contest"}, {"Nathaniel": "There are 3 wizards. Each of them represents a different element which can be easily identified by a unique colour. …"}, {"Nathaniel": "There is ‘orange’ for wizard Furb of Fun, ‘green’ for wizard Fern of Nature and ‘violet’ for wizard Feiz of Power."}, {"Player": "Zaoan"}, {"Nathaniel": "Well, it’s a long story. It has a lot to do with wizardry, a little with chess and quite much with a lady. I know that there must be a book about it, somewhere in a library in Thais."}, {"Player": "bye"}, {"Nathaniel": "Farewell friend."}]}, {"file": "../npc/Event/Messenger_of_Santa.md", "conversation": [{"Player": "hi / hello"}, {"Messenger of Santa": "Merry Christmas, if it is Christmas decoration you seek, I can help you!"}, {"Player": "buy / goods / stuff / store / ware"}, {"Messenger of Santa": "Just ask me for a trade if you want to buy something! I would like to add that a considerable part of each purchase will go directly into the welfare fund of our beloved reindeer!"}, {"Player": "christmas"}, {"Messenger of Santa": "Merry Christmas!"}, {"Player": "decoration / trade"}, {"Messenger of Santa": "Have a look. Most furniture comes in handy kits. Just use them in your house to assemble the furniture."}, {"Player": "bye"}, {"Messenger of Santa": "Goodbye then and Merry Christmas!"}]}, {"file": "../npc/Event/Balduin_The_Baker.md", "conversation": [{"Player": "hi"}, {"Balduin The Baker": "Hi there Bennie. I guess you are here to assist me in my job!"}, {"Player": "job / help"}, {"Balduin The Baker": "I'm a member of the Magic Bakery Alliance. We are an order that is dedicated to further the knowledge of bakery for the benefit of mankind. Our goals are as numerous as the recipes we come up with each season."}, {"Player": "goals"}, {"Balduin The Baker": "Currently we are trying to reclaim another part of Kullu's wisdom. Year after year, we try our best to break the defences of Cake Keep Isle."}, {"Player": "Kullu"}, {"Balduin The Baker": "He was a great mage but an even greater cook. His recipes and spells are priceless. Sadly, even if we succeed in breaking the defences of Cake Keep Isle, we will only manage to decipher a tiny fraction of his knowledge. ..."}, {"Balduin The Baker": "And still, we don't know what happened to Kullu. He retreated from our world to fully concentrate on his research on cooking recipes and spells. ..."}, {"Balduin The Baker": "He was some sweet tooth for all that we know. And for sure a genius when it comes to baking and magic. ..."}, {"Balduin The Baker": "His kitchen magic was that amazing, you could not tell where baking ended and magic started."}, {"Player": "keep"}, {"Balduin The Baker": "To be undisturbed, he placed his keep on an isle that existed on a planar instability which allowed him to phase the isle out of existence for most of the time. ..."}, {"Balduin The Baker": "Additionally he surrounded the isle with a sorcery of his invention that defied most attempts to reach it. ..."}, {"Balduin The Baker": "It took us quite a while to figure out that he'd never be able to weave a protection spell against something he loved so dearly like cakes and bakery wares. ..."}, {"Balduin The Baker": "So we came up with the idea of the bridge."}, {"Player": "bridge"}, {"Balduin The Baker": "After a few failed attempts with gingerbread boats and the like, we figured out how to reach Cake Keep Isle. We used the very ingredients we could derive from his cake golem attacks to build a stable cake bridge to his isle."}, {"Player": "golem"}, {"Balduin The Baker": "Ah well, that's an .. uhm .. funny story. ..."}, {"Balduin The Baker": "You see, after the first expedition reached the isle, they took so long trying to find a way to Kullu's secrets that the isle began to vanish into the void while they were still there. ..."}, {"Balduin The Baker": "The entire time, they were harassed by Kullu's cake golem guardians of the keep. In the last minute, they cast emergency teleports to their home cities. ..."}, {"Balduin The Baker": "The good thing is it was not too late and all escaped. Well, the bad thing is their spells somehow reacted with the void-rift of that place, building astral tunnels from the void to said cities. ..."}, {"Balduin The Baker": "Now, whenever the isle manifests, the tunnels manifest as well. The ugly part is that through this one-way tunnels the cake golem army that was apparently sucked into the void has access to the cities and can raid them. ..."}, {"Balduin The Baker": "But they are not only an annoyance but also our greatest chance. Nasty but tasty little buggers. They can be troublesome but we need them for our bridge construction."}, {"Player": "chance"}, {"Balduin The Baker": "The golems that raid the cities supply us with two major materials that we need to build our bridge to Cake Keep Isle. ..."}, {"Balduin The Baker": "One component is the sugary mass that can be gained if you slay one of them. We use it as a kind of mortar. ..."}, {"Balduin The Baker": "The second part is a bit trickier to get. It is the raw cake material. It is kind of challenging to gain it. We built extraction machines that can drain the base material from the still animated corpses. ..."}, {"Balduin The Baker": "We placed one in each of the raided cities. You will have to lure the golems into the machines, to extract the material from them. ..."}, {"Balduin The Baker": "We need it to have a stable base material that is resilient against wind, weather and salt water."}, {"Player": "mass"}, {"Balduin The Baker": "We accumulated 116 of 200 sugary mass. We can't fail this year! We will not allow it!"}, {"Player": "base"}, {"Balduin The Baker": "I'm somewhat worried. Getting the base material is always the tricky part. People are usually a bit too eager to kill. We accumulated 140 of 200 base material until now."}, {"Player": "name"}, {"Player": "bakery"}, {"Balduin The Baker": "We are a mystic order of bakers who pursue goals for the benefit of all mankind. Don't even listen to the lies and propaganda spread by those who envy us."}, {"Player": "lies"}, {"Balduin The Baker": "Though most of our noble order abandoned the more theoretical studies at the academies, it is an evil lie that we are failed students who know more about drinking and eating than about magic. ..."}, {"Balduin The Baker": "Once we have revealed all of Kullu's secrets, we will be envied by all. And of course we all will become famous and incredibly rich."}, {"Player": "order"}, {"Balduin The Baker": "We are a mystic baker order. Don't listen to those who envy us and spread ugly lies and propaganda. We are dedicated to uncover the greatest secrets about cooking and baking. ..."}, {"Balduin The Baker": "Baking is the only trade worth to be considered. Without bakers everyone would starve. We are what ties a society together, preferably with a thick, sticky and sweet mass made of fruits. ..."}, {"Balduin The Baker": "We are the momentum of culture. Baking is what divides civilization from barbarism."}, {"Player": "bye"}, {"Balduin The Baker": "Good bye."}]}, {"file": "../npc/Event/Rosemarie.md", "conversation": [{"Player": "hi"}, {"Rosemarie": "Greetings and nature’s blessing, traveller!"}, {"Player": "ab’dendriel"}, {"Rosemarie": "The elves found the perfect balance between living from the plants and living with the plants. They should be role models for every living being"}, {"Player": "ankrahmun"}, {"Rosemarie": "It has its charm but the more plants I have around me the better I feel."}, {"Player": "queen"}, {"Rosemarie": "The griffinclaw is the queen among the plants."}, {"Player": "blessing"}, {"Rosemarie": "I’m here to celebrate life. I will stay with you mortals for a while. I exchange seeds, which you might have found on your adventures, for flowerpots with rare seedlings."}, {"Player": "carlin/venore/thais"}, {"Rosemarie": "I prefer to stay outside of towns but this spot here is tolerable."}, {"Player": "care/plant"}, {"Rosemarie": "You will have to water it regularly, then it will flourish and grow. There are several stages of growth that your plant has to pass …"}, {"Rosemarie": "With good care and luck, it will grow into the next stage until it finally becomes a fully blooming flower. …"}, {"Rosemarie": "Of course plants won’t grow in the darkness of a depot box. On the other hand, it won’t dry out there either …"}, {"Rosemarie": "So if you know you can’t take care of your plant for a longer time, it might be a good idea to store it into your depot box."}, {"Player": "crunor"}, {"Rosemarie": "The bringer of life and fertility is worshipped by all dryads."}, {"Player": "dryad"}, {"Rosemarie": "Dryads are the daughters of Crunor and the protectors of plant life. Sadly, most of my sisters are quite aggressive on their mission."}, {"Player": "dwarf"}, {"Rosemarie": "I accept every way of life but this of the dwarfs is not mine. Without sunlight, I would shrivel within days like a plant."}, {"Player": "elf/elves"}, {"Rosemarie": "The elves found the perfect balance between living from the plants and living with the plants. They should be role models for every living being."}, {"Player": "flower"}, {"Rosemarie": "Flowers are one of the most beautiful gifts that Crunor blessed us with. They are very delicate creatures and must be treated with utmost care."}, {"Player": "king"}, {"Rosemarie": "For me, the trees in the jungle of Tiquanda are the kings. Oh, you mean the Tibian king? I’m not interested in human bureaucracy."}, {"Player": "job"}, {"Rosemarie": "I’m here to celebrate life. I will stay with you mortals for a while. I exchange seeds, which you might have found on your adventures, for flowerpots with rare seedlings."}, {"Player": "jungle/port hope"}, {"Rosemarie": "I love to stroll around in the jungle. The diversity of plants is fantastic there and even the poisonous spit nettle remains calm if it feels the unconditional love for all plants in your heart."}, {"Player": "liberty bay"}, {"Rosemarie": "I prefer to stay outside of towns to enjoy the nature around me."}, {"Player": "mission"}, {"Rosemarie": "Many dryads consider almost everything that is no plant as a threat to plants and the forests …"}, {"Rosemarie": "Humans that lumber our forests to build their wooden caves and the strange things they use to cross the seas are especially threatening."}, {"Player": "name"}, {"Rosemarie": "I’m Rosemarie the dryad, and just like my name is linked to flowers, my whole existence is connected to the life of plants."}, {"Player": "news"}, {"Rosemarie": "I don’t know any news that you mortals would be interested in."}, {"Rosemarie": "If you bring me 5 seeds, I’ll give you a flowerpot with a rare seedling. With good care and a little love, it will grow into a beautiful plant."}, {"Player": "seed"}, {"Rosemarie": "Each seed is like a baby to us dryads. For every 5 seeds you bring me, I’ll reward you with a flowerpot that contains a seedling that might flourish into a rare and beautiful plant if you care for it. …"}, {"Rosemarie": "Do you have any seeds that you would like to exchange?"}, {"Player": "no"}, {"Rosemarie": "Perhaps you are interested when you have more seeds."}, {"Player": "seed-yes"}, {"Rosemarie": "Here, I planted this little baby in a flowerpot for you. Don’t forget to water it regularly – buy a watering can somewhere!"}, {"Player": "bye/farewell"}, {"Rosemarie": "Farewell."}]}, {"file": "../npc/Event/Biff_The_Baker_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Gelidrazah's_Thirst_EMPTY.md", "conversation": []}, {"file": "../npc/Event/Jean_Pierre_EMPTY.md", "conversation": []}]